In [11]:
import sys
sys.path.append("../src")

import plotly.graph_objs as go
import plotly.offline as py

import utilities as u
import constants as c

In [12]:
df = u.uos.get_df(c.os.FILE_DATA_SAMPLE)

In [13]:
df.head()

         Note  Amount Category       Date Month_date  Month  Year      Type
ID
1   Apartment     500     Rent 2017-01-01 2017-01-01      1  2017  Expenses
2   Apartment     500     Rent 2017-02-01 2017-02-01      2  2017  Expenses
3   Apartment     500     Rent 2017-03-01 2017-03-01      3  2017  Expenses
4   Apartment     500     Rent 2017-04-01 2017-04-01      4  2017  Expenses
5   Apartment     500     Rent 2017-05-01 2017-05-01      5  2017  Expenses

In [15]:
def violin_plot(dfg, col_group):

    df = dfg.groupby([c.cols.YEAR, c.cols.MONTH, c.cols.TYPE]).sum().reset_index()
    
    iter_data = [
        (c.names.EXPENSES, "negative", c.colors.EXPENSES), 
        (c.names.INCOMES, "positive", c.colors.INCOMES)
    ]
    
    data = []
    
    for name, side, color in iter_data:
        
        df_aux = df[df[c.cols.TYPE] == name]
        
        data.append(
            go.Violin(
                x=df_aux[col_group], y=df_aux[c.cols.AMOUNT],
                name=name, side=side, line={"color": color}
            )
        )
        
    py.plot(data)
    
violin_plot(df, "Year")